// Всі функції повинні бути описані стрілочним типом!!!!
//     - створити функцію яка обчислює та повертає площу прямокутника висотою

const PI = 3.14;
let r = 2;
let square = () => {
    return 2*PI*(r**2);
}

console.log(square());

// - створити функцію яка обчислює та повертає площу кола

let r1 = 3;
let roundSquare = () => {
    return PI*(r**2);
}

console.log(roundSquare());

// - створити функцію яка обчислює та повертає площу циліндру

let r2 = 4;
let h = 2;
let squareСylinder = () => {
    return 2*PI*r2*h;
}

console.log(squareСylinder());

// - створити функцію яка приймає масив та виводить кожен його елемент

let massive = ['okten', 'hello', 1, 2, 3];
let mas = () => {
    return massive;
}

console.log(mas());

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент

let paragraph = (text) => text;
document.write(paragraph("Текст — середній елемент схеми комунікації, яку можна уявити у вигляді триелементної структури: автор (адресант) → текст → читач (адресат). Як серединний (проміжний) елемент комунікативного акту текст виявляє свою специфіку у кодуванні і декодуванні. Щодо мовця (адресанта) текст є кодованою величиною, оскільки мовець кодує певну інформацію. Для сприйняття вміщеної у тексті інформації читач повинен її декодувати"));

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий


// let list = (text1) => {
//     document.write(`<ul>`);
//     for (let i = 0; i < 3; i++) {
//         document.write(`<li> ${text1}</li>`)
//     }
//     document.write(`</ul>`);
//     return text1;
// }
//
// list('lorem ipsum');

// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)


let list2 = (text, size) => {
document.write(`<ul>`);
    for (let i = 0; i < size; i++) {
        document.write(`<li>${text}</li>`)
    }
document.write(`</ul>`);
}

list2( 'Java — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems', 6 );

// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

let list4 = (...mass2) => {
    document.write(`<ul>`);
    for (const mass2Element of mass2) {
        document.write(`<li>${mass2Element}</li>`)
    }
    document.write(`</ul>`);
}

list4 ( 'hello', 'world', false, true, 1, 2, 3 );

// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.

let massive1 = (...objects) => {
    for (const object of objects) {
        document.write(`<div> ${object.id} ${object.name} ${object.age}</div>`);
    }
}

massive1( { id: 1234, name: 'ivan', age: 25}, { id: 1235, name: 'sasha', age: 18}, { id: 1236,name: 'tihon',age: 33 });